#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//数组指针：在二维数组里使用，将其看作一维数组，指针指向每行，将每行看作一个数组元素
//void print(int(*p)[5],int x,int y)    
//{
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < x; i++)
//	{
//		for (j = 0; j < y; j++)
//		{
//			/*把三行五列的二维数组看作三个元素，每个元素是一个五个元素的一维数组
//			  p是二维数组首元素地址，也就是第一行的五个元素的数组指针
//			  p+i就是遍历三行即三个元素，得到它们的地址
//			  +j遍历得到每个元素地址,解引用得到每个元素
//			  */
//			//printf("%d ", *(*(p + i)+j) );    
//			
//			/*这样也可以
//			  p是二维数组首元素地址，也就是第一行的五个元素的数组指针
//			  p+i就是遍历三行即三个元素，得到它们的地址
//			  解引用得到每个数组，再当一维数组就好
//			  */
//			//printf("%d ", (*(p + i))[j]);    //这是正确的,*先与数组指针结合，得到行元素，再通过[]得到列元素
//			//printf("%d ", *(p + i)[j]);    //这是错的，这种参数等价于*( (p + i)[j] )
//
//			//这是最简单的
//			printf("%d ", p[i][j]);
//		}
//		printf("\n");
//	}
//	return;
//}
//int main()
//{
//	int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };
//	print(arr, 3, 5);
//	return 0;
//}

//杨辉三角
//void pascal(int n)
//{
//	int i = 0;
//	int j = 0;
//	int arr[100][100] = { 0 };
//	for (i = 1; i <= n; i++)
//	{
//		for (j = 1; j <= i; j++)
//		{
//			if (i == j || j == 1)
//			{
//				arr[i][j] = 1;
//			}
//			else
//			{
//				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//			}
//			printf("%-5d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	printf("\n");
//	return;
//}
//int main()
//{
//	int input = 0;
//	printf("输入要计算的杨辉三角的行数：");
//	scanf("%d", &input);
//	pascal(input);
//	return 0;
//}

//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词:
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手
//int main()
//{
//	char murder = 0;
//	for (murder = 'A'; murder < 'D'; murder++)
//	{
//		if ((murder != 'A') + (murder == 'C') + (murder == 'D') + (murder != 'D') == 3)
//		{
//			printf("凶手是：%c\n", murder);
//		}
//	}
//	return 0;
//}

//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//int main()
//{
//	char arr[5] = { 0 };
//	//a,b,c,d,e分别代表五个人
//	int a = 0;
//	for (a = 1; a <= 5; a++)
//	{
//		int b = 0;
//		for (b = 1; b <= 5; b++)
//		{
//			int c = 0;
//			for (c = 1; c <= 5; c++)
//			{
//				int d = 0;
//				for (d = 1; d < 5; d++)
//				{
//					int e = 0;
//					for (e = 1; e < 5; e++)
//					{    //这里判断重复不能用加法，因为2+4 = 1+5
//						if (((a == 3) + (b == 2) == 1) && ((b == 2) + (e == 4) == 1) &&
//							((c == 1) + (d == 2) == 1) && ((d == 3) + (c == 5) == 1) &&
//							((e == 4) + (a == 1) == 1) && (a * b * c * d * e == 120))
//						{
//							printf("A:%d B:%d C:%d D:%d E:%d\n", a, b, c, d, e);
//						}
//					}
//				}
//			}
//		}
//	}
//}

